validation/blastFSIFoam/blastLoadedPlate/system/plate/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../../geometry"

blocks
(
    hex (0 1 4 3 0 1 9 8) ($nxPlate $nyPlate 1) simpleGrading (1 1 1)
//     hex (0 1 3 2 8 9 11 10) ($nxPlate $nyPlate $nxPlate) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    plate_to_air
    {
        type patch;
        sampleMode nearestPatchFace;
        sampleRegion air;
        samplePatch air_to_plate;
        faces
        (
            (1 4 9 1)
//             (2 3 11 10)
        );
    }
    plateEnd
    {
        type patch;
        faces
        (
             (3 4 9 8)
//             (1 3 11 9)
//             (8 9 11 10)
        );
    }
    plateFree
    {
        type patch;
        faces
        (
             (0 3 8 0)
//             (0 1 9 8)
        );
    }
//     symmetry0
//     {
//         type symmetry;
//         faces
//         (
//              (0 1 3 2)
//         );
//     }
//     symmetry1
//     {
//         type symmetry;
//         faces
//         (
//              (0 8 10 2)
//         );
//     }
    wedge0
    {
        type wedge;
        faces
        (
             (0 1 4 3)
        );
    }
    wedge1
    {
        type wedge;
        faces
        (
             (0 1 9 8)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
