validation/blastFSIFoam/blastLoadedPlate/constant/air/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   movingAdaptiveFvMesh;
errorEstimator  scaledDelta;      // Model used to estimate error
scaledDeltaField p;

motionSolver    displacementLaplacian;

displacementLaplacianCoeffs
{
    diffusivity quadratic inverseDistance (air_to_plate);
}

// beginUnrefine 1;

// How often to refine
refineInterval  3;

// Refine field in between lower..upper (varies based on errorEstimator)
lowerRefineLevel 0.01;

// If value < unrefineLevel unrefine
unrefineLevel   0.01;

// Number of cells refined around high error cells
nBufferLayers   3;

// Refine cells only up to maxRefinement levels
maxRefinement   3;

// Write the refinement level as a volScalarField
dumpLevel       true;

// ************************************************************************* //
