validation/blastFSIFoam/blastLoadedPlate/constant/plate/solidProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      solidProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solidModel explicitNonLinearGeometryTotalLagrangian;


explicitNonLinearGeometryTotalLagrangianCoeffs
{
    incompressiblilityCoefficient   1.0;
    angularMomentumConservation     no;

    // Maximum number of momentum correctors
    nCorrectors             2000;

    // Solution tolerance for displacement
    solutionTolerance       1e-06;

    // Alternative solution tolerance for displacement
    alternativeTolerance    1e-06;

    // Material law solution tolerance
    materialTolerance       1e-06;

    // Write frequency for the residuals
    infoFrequency           100;
}


// ************************************************************************* //
