validation/blastFSIFoam/blastLoadedPlate/constant/plate/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/heater";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type basic;

thermoType
{
    transport       constIso;
    thermo          hConst;
    equationOfState rhoConst;
}

specie
{
    molWeight       60.08;
}
equationOfState
{
    rho0             8060;
}
transport
{
    kappa           0.36;
}
thermodynamics
{
    Hf              0;
    Cp              500;
}
thermalStress false;

// ************************************************************************* //
