validation/blastFSIFoam/blastLoadedPlate/0/plate/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    plate_to_air
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    plateEnd
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    plateFree
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    wedge
    {
        type            wedge;
        value           $internalField;
    }

    symmetry
    {
        type            symmetry;
        value           $internalField;
    }
}

// ************************************************************************* //
