validation/blastFSIFoam/blastLoadedPlate/0/air/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    outlet
    {
        type            slip;
    }

    ground
    {
        type            slip;
    }

    air_to_plate
    {
        type            globalMapped;
        nbrName         pointD;
        value           $internalField;
    }

    wedge
    {
        type            wedge;
    }

    symmetry
    {
        type            symmetry;
    }
}

// ************************************************************************* //
