validation/blastFSIFoam/blastLoadedPlate/system/plate/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "system/ground";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(D|DD|T)"
    {
        solver          PCG;
        tolerance       1e-12;
        relTol          0.1;
        preconditioner  DIC;
    }
}

relaxationFactors
{
//     D  0.5;
//     DD 0.5;
//     T  1;
}

// ************************************************************************* //
