validation/blastFSIFoam/blastLoadedPlate/system/air/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../../geometry"

fields (alpha.tnt);
nBufferLayers 1;

defaultFieldValues
(
    volScalarFieldValue alpha.tnt    0
);


regions
(
    sphericalMassToCell
    {
        centre  ($R 0 0);
        mass    $W;
        rho     1630;

        backup
        {
            centre ($R 0 0);
            radius 0.25;
        }
        refineInternal yes;
        level 4;

        fieldValues
        (
            volScalarFieldValue alpha.tnt    1
        );
    }
);


// ************************************************************************* //
